
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 9 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_application_insights.appinsights
  * azurerm_application_insights.appinsights_preview[0]
  * azurerm_key_vault_secret.redis_access_key
  * azurerm_resource_group.rg
  * module.key-vault.azurerm_key_vault.kv
  * module.key-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.key-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.prl-citizen-frontend-session-storage.azurerm_resource_group.cache-resourcegroup[0]
* Replace
  * module.prl-citizen-frontend-session-storage.azurerm_private_endpoint.this[0]
  * module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.Insights/components/prl-appinsights-aat"
        name                                  = "prl-appinsights-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_application_insights.appinsights_preview[0] will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights_preview" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.Insights/components/prl-appinsights-preview"
        name                                  = "prl-appinsights-preview"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://prl-aat.vault.azure.net/secrets/redis-access-key/41654f1ab15a47eab0fd7ba37a56eb75"
        name                    = "redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat"
        name     = "prl-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.key-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat"
        name                            = "prl-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (13 unchanged attributes hidden)

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # module.key-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)

      - timeouts {}
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-aat/providers/Microsoft.KeyVault/vaults/prl-aat|prl-aat"
        name                       = "prl-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prl-aat-mi"
        name                = "prl-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.prl-citizen-frontend-session-storage.azurerm_private_endpoint.this[0] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Network/privateEndpoints/prl-citizen-frontend-redis-aat" -> (known after apply)
        name                     = "prl-citizen-frontend-redis-aat"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Network/networkInterfaces/prl-citizen-frontend-redis-aat.nic.06376d3e-fbeb-4b84-a820-003350e4193c"
              - name = "prl-citizen-frontend-redis-aat.nic.06376d3e-fbeb-4b84-a820-003350e4193c"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Network/privateEndpoints/prl-citizen-frontend-redis-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup/privateDnsZoneConfigs/privatelink.redis.cache.windows.net"
              - name                = "privatelink.redis.cache.windows.net"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "prl-citizen-frontend-redis-aat.privatelink.redis.cache.windows.net"
                      - ip_addresses = [
                          - "10.96.136.8",
                        ]
                      - name         = "prl-citizen-frontend-redis-aat"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Network/privateEndpoints/prl-citizen-frontend-redis-aat/privateDnsZoneGroups/redis-endpoint-dnszonegroup" -> (known after apply)
            name                 = "redis-endpoint-dnszonegroup"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "prl-citizen-frontend-redis-aat"
          ~ private_connection_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Cache/redis/prl-citizen-frontend-redis-aat" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.96.136.8" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.prl-citizen-frontend-session-storage.azurerm_redis_cache.redis must be replaced
-/+ resource "azurerm_redis_cache" "redis" {
      ~ family                        = "P" -> "C"
      ~ hostname                      = "prl-citizen-frontend-redis-aat.redis.cache.windows.net" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat/providers/Microsoft.Cache/redis/prl-citizen-frontend-redis-aat" -> (known after apply)
        name                          = "prl-citizen-frontend-redis-aat"
      ~ port                          = 6379 -> (known after apply)
      ~ primary_access_key            = (sensitive value)
      ~ primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      ~ redis_version                 = "6.0" -> "6"
      ~ replicas_per_master           = 0 -> (known after apply)
      ~ replicas_per_primary          = 0 -> (known after apply)
      ~ secondary_access_key          = (sensitive value)
      ~ secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      ~ sku_name                      = "Premium" -> "Basic" # forces replacement
      ~ ssl_port                      = 6380 -> (known after apply)
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
      - tenant_settings               = {} -> null
      - zones                         = [] -> null
        # (6 unchanged attributes hidden)

      ~ redis_configuration {
          - aof_backup_enabled              = false -> null
          ~ maxclients                      = 7500 -> (known after apply)
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
            # (5 unchanged attributes hidden)
        }
    }

  # module.prl-citizen-frontend-session-storage.azurerm_resource_group.cache-resourcegroup[0] will be updated in-place
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/prl-citizen-frontend-redis-cache-aat"
        name     = "prl-citizen-frontend-redis-cache-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git" -> null
            "application"         = "family-private-law"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#prl-tech-notifications"
            "environment"         = "staging"
            "managedBy"           = "Private Law"
        }
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 9 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":31,"Program":"tfcmt","SHA1":"","Vars":{}} -->